word = input()
print(word , '? Конечно, помню, ведь мы проходили это на прошлом занятии!')


word = input()
if word == "Python":
    print("ДА")
else:
    print("НЕТ")


word = input()
print(word * 4)


text = input("Введите строку: ")
if "кот" in text:
    print("МЯУ")
else:
    print("ГАВ")


a= input("Введите раз: ")
b = input("Введите два: ")
c = input("Введите три: ")
if a == "раз" and b == "два" and c == "три":
    print("ГОРИ")
else:
    print("НЕ ГОРИ")


a = input("Введите только 'раз' или '1': ")
b = input("Введите только 'два' или '2': ")
c = input("Введите только 'три' или '3': ")
if (a == "раз" and b == "два" and c == "три") or (a == "1" and b == "2" and c == "3"):
    print("ГОРИ")
else:
    print("НЕ ГОРИ")


print('Ответьте на два вопроса "да" или "нет".')
print('Вы когда-нибудь были в Казани?')
question1 = input()
print('Считаете одного дня хватает для знакомства с городом?')
question2 = input()
if question1 == 'да' and question2 == 'да':
    print('Отлично! Вы побывали в прекрасном городе!')
elif question1 == 'да' and question2 == 'нет':
    print(' Здорово, приезжайте ещё!')
elif question1== 'нет' and question2 == 'да':
    print(' Может быть в другой раз?')
else:
    print(' Попробуйте найти свободное время!')


grade = input()
if grade == '5':
    print('Отлично!')
elif grade == '4':
    print('Хорошо.')
elif grade == '3':
    print('Удовлетворительно.')


login = input("Введите логин: ")
email = input("Введите email: ")
if "@" in email and "@" not in login:
    print("OK")
else:
    print("ОШИБКА")


print("Доброе утро! Вы решили сварить овсяную кашу на завтрак.")
answer1 = input("Сначала налить в кастрюлю молоко и включить средний огонь? (да/нет): ")
if answer1.lower() == "да":
    print("\nМолоко начинает закипать.")
    answer2 = input("Засыпать овсяные хлопья в горячее молоко и перемешать? (да/нет): ")
    if answer2.lower() == "да":
        print("\nКаша почти готова.")
        answer3 = input("Добавить соль и сахар по вкусу? (да/нет): ")
        if answer3.lower() == "да":
            print("\nКаша на завтрак готова!")
            answer4 = input("Положить сверху кусок сливочного масла? (да/нет): ")
            if answer4.lower() == "да":
                print("\nМасло отлично дополнило кашу своим сливочным вкусом.")
                print("Каша получилась идеальной. Приятного аппетита!")
            else:
                print("\nКаша получилась полезной, но немного сухой.")
                print("Без сливочного масла ей не хватает той самой нежной текстуры.")
        else:
            print("\nСоли нет. Сахара нет. Каша безвкусная.")
            print("Вы с трудом доедаете тарелку пресной овсянки.")
    else:
        print("\nВы насыпали хлопья в холодное молоко.")
        print("Каша не получилась.")
else:
    print("\nВы передумали готовить завтрак?")
    print("Отдохните от готовки сегодня! Закажите доставку!")

